{
    "banner": {
        "title": "MSU Maps",
        "description": "Discover your new home",
        "image": "mapsbackground.jpg",
        "alt": "The MSU maps website screenshot",
        "url": "https://maps.msu.edu"
    },
    "description": {
        "paragraphs": {
            "1": {
                "content": "The MSU Maps was my baby when I was working as a Student Programmer at Michigan State. My first task was to add the construction overlays onto the map. This included taking a JSON file of coordinates describing road closures, road detours, and closed areas and outputting that onto the map in a toggleable fashion. No pressure really, this was only going to be seen by every MSU student or parent, not to mention this was the very first website I had ever done any work on. This was also before I had even been able to take any programming classes at MSU. Talk about jumping into the fire..."
            },
            "2": {
                "content": "Getting through that first month was crazy. What is Javascript? How do I style something? Why does this work in Chrome but not in IE6? That last question probably being the most relentless pest as it was for many web developers.  But I learned a great deal here and knew that this is where I wanted to be. Being able to go to class every day and know that I was helping the community I was apart of was and still is an awesome feeling. Any time I would hear about some issue a student would face, I would go into work the next day and fix it right away. Want to be able to search the map more effectively? Let me tie the map and the search API I'm also working on together. The layout is unable to be navigated via keyboard? Let me redesign the entire layout so everything is cleaned up and accessible. Want to get directions from your dorm to the engineering building? I've got a wayfinding API I can hook into to fix that too."
            },
            "3": {
                "content": "I was able to overcome my fears and worries and implement that first feature and go on to implement many more. Maps.msu.edu is a site I can truly say I wrote and touched every single line of code in. Over the course of 3 years, I was able to take it from its 2008 roots and bring it into the modern era with a fresh new layout, updated Javascript, and the introduction of SASS, Grunt, and Bower."
            }
        }
    },
    "topbar": {
        "startDate": "Jan 1, 2014",
        "endDate": "May 31 2017",
        "tech": ["Javascript", "jQuery", "CSS/SASS", "Grunt", "Bower", "PHP", "MySQL"],
        "role": ["Web Developer"]
    }
}