{
    "banner": {
        "title": "MSU Mobile App",
        "description": "Enhancing the Spartan Experience",
        "image": "msuappbackground",
        "alt": "The MSU mobile app",
        "url": "https://msu.app"
    },
    "description": {
        "paragraphs": {
            "1": {
                "content": "This is the official app of Michigan State University and is released for iOS and Android devices. This app allows you to keep up-to-date with the latest events, top news stories, explore the in-depth map of MSU campus, review dining options, and see grades and your schedule—all from your mobile device. Also, we are currently looking to add parking options to the app, as well as building out a discover tab to let students find clubs, majors, classes, and more."
            },
            "2": {
                "content": "During my time working on the MSU App, I took on the role of Designer, iOS Developer, and Android Developer. Being on a team of 3 allowed me to wear many hats while learning from my peers about mobile development. I had never done mobile development before (Outside of a typical one-off test app), so this opportunity was fantastic for me. Early on in the project, I implemented a lot of features on the Android side. In particular, I worked on adding bus positions and dining locations on the map fragment, cleaned up the app to follow accessibility guidelines, and recently started redesigning the app."
            },
            "3": {
                "content": "Redesigning the app was an awesome experience. I had played around in Sketch and Adobe InDesign for a while trying to figure out what was the best way to provide the best user experience, but MSU was able to partner with Apple's Design Lab. The team flew out to Cupertino for a 3-day workshop on user experience and design principles. I was able to work alongside the designers at Apple and students we had brought to help redesign the app and find what features mattered. After that workshop, I came back to MSU and started working on the new official designs based on the lessons we learned from the workshop. I made sure the refine my ideas as much as possible with students, meeting multiple times during the process to hear their thoughts."
            },
            "4": {
                "content": "Since then, we've got the green light on my redesign and are now implementing it on iOS! Android will be following suit soon after (The unfortunate nature of a small team). I'm very proud of the work I've done so far, and I am looking forward to learning and developing this app to the best of my ability."
            }
        }
    },
    "topbar": {
        "startDate": "May 31, 2019",
        "endDate": "Ongoing",
        "tech": ["Kotlin", "Swift", "AWS", "Sketch", "Adobe Suite"],
        "role": ["Designer", "iOS Developer", "Android Developer"]
    }
}